//引入mockjs
const Mock = require("mockjs");
//使用mockjs模拟数据

Mock.mock("/api/mission/list", {
  "data|10": [
    {
      "key|+1": 1,
      "title|1": [
        "可口可乐(污水)自动运维任务20/02/13(#1879)",
        "可口可乐(烟气)自动运维任务20/02/13(#1878)",
        "可口可乐(污水)自动运维任务20/02/13(#1877)"
      ],
      "station|1": ["站点1", "站点2", "站点3"],
      "company|1": ["可口可乐佛山有限公司"],
      "status|1": ["已创建", "待处理", "处理中"],
      "team|1": ["A小组", "B小组"],
      "time|1": ["2020-3-25", "2020-3-20"],
      "plan|1": ["废水现场维护", "烟气现场维护"], //站点任务
      "num|1": ["2", "5", "1", "2"], //站点任务
      "userName|1": ["小张", "小李"], //上报投诉
      "source|1": ["上级指示", "客户建议", "客户投诉"], //上报投诉
      "status1|1": ["完成", "忽略", "待处理"], //上报投诉
      "time1|1": ["2020-3-25 15:23:12", "2020-3-20 10:23:25"] //上报投诉
    }
  ],
  total: 10
});

//车辆使用记录
Mock.mock("/api/car/list", {
  "data|10": [
    {
      "key|+1": 1,
      "time|1": ["2020-3-25", "2020-3-20"],
      "carName|1": ["粤A12345", "粤A88888", "粤A99999"],
      "distance|1": ["75km", "30km", "60km"],
      "aveSpeed|1": ["80km/h", "60km/h"],
      "maxSpeed|1": ["120km/h", "100km/h"], //站点任务
      "longTime|1": ["1h", "0.5h"], //上报投诉
      "status|1": ["可用", "停用"],
      "team|1": ["A小组", "B小组"]
    }
  ],
  total: 10
});

//违章管理
Mock.mock("/api/violation/list", {
  "data|10": [
    {
      "key|+1": 1,
      "time|1": ["2020-1-25", "2020-1-20"],
      "carName|1": ["粤A12345", "粤A88888", "粤A99999"],
      "address|1": ["广州市", "佛山市"], //站点任务
      "behavior|1": ["超速", "压线"], //上报投诉
      "num|1": ["6", "3"],
      "signTime|1": ["2020-2-5 12:32:00", "2020-2-15 12:32:00"]
    }
  ],
  total: 10
});

//系统平台
Mock.mock("/api/announcement/list", {
  "data|10": [
    {
      "key|+1": 1,
      "title|1": ["运维平台APP", "运维平台"],
      "content|1": ["下载地址", "更新版本"],
      "type|1": ["开发", "维护"],
      "name|1": ["张三", "李四"],
      "time|1": ["2020-2-5 12:32:00", "2020-2-15 12:32:00"]
    }
  ],
  total: 10
});

//部门管理列表
Mock.mock("/api/department/list", {
  "data|6": [
    {
      "key|+1": 1,
      "name|1": ["张三", "李四"],
      "tel|1": ["13452525252", "13888888888"],
      "email|1": ["1213@126.com", "8888@126.com"],
      "position|1": ["维护", "开发"]
    }
  ],
  total: 10
});

//成员管理列表
Mock.mock("/api/member/list", {
  "data|6": [
    {
      "key|+1": 1,
      "name|1": ["张三", "李四"],
      "tel|1": ["13452525252", "13888888888"],
      "department|1": ["A小组", "B小组"],
      "position|1": ["维护", "开发"],
      "role|1": ["管理员", "运维人员"],
      "status|1": ["已激活", "未激活"],
      "email|1": ["1213@126.com", "8888@126.com"],
      "address|1": ["广州市", "惠州市"],
      "sex|1": ["男", "女"],
      "num|1": ["001", "002"],
      "telNum|1": ["562", "325"]
    }
  ],
  total: 10
});
